test/load-test.yml
config:
  target: "http://localhost:3000"
  phases:
    - duration: 60
      arrivalRate: 5  # Moderate rate for better traceability
  plugins:
    expect: {}

scenarios:
  - flow:
      - post:
          url: "/api/pokemon/pikachu"
          expect:
            - statusCode: 201
      - think: 5s
      - get:
          url: "/api/pokemon/pikachu"
          expect:
            - statusCode: 200
      - think: 5s
      - get:
          url: "/api/pokemon"
          expect:
            - statusCode: 200
      - think: 5s
      - delete:
          url: "/api/pokemon/pikachu"
          expect:
            - statusCode: 200
      - think: 5s
      - get:
          url: "/api/pokemon"
          expect:
            - statusCode: 200